<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.SuspiciousPackageQLP</string>
	<key>Description</key>
	<string>Downloads Suspicious Package QuickLook plugin and copies pkg.</string>
	<key>Identifier</key>
	<string>com.github.golbiga.install.SuspiciousPackageQLP</string>
	<key>Input</key>
	<dict>
		<key>Name</key>
		<string>SuspiciousPackage</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/SuspiciousPackage.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>