<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Adobe AIR installer and repackages it for unattended, silent installation.
Based on jamesz's work here: https://github.com/jamesez/automunki/tree/master/adobe-air Then, uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.autopkg.jss.AdobeAIR</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AdobeAIR</string>
			<key>JSS_INVENTORY_NAME</key>
			<string>Adobe AIR Application Installer.app</string>
            <key>CATEGORY</key>
            <string>Media Plugins and Viewers</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
			<!--PlistReader w/o variable injection in AutoPkg requires this-->
			<key>version</key>
			<string/>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/AdobeAIR.png</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/AdobeAIRSmartGroupTemplate.xml</string>
            <key>DESCRIPTION</key>
            <string></string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.AdobeAIR</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
					<key>jss_inventory_name</key>
					<string>%JSS_INVENTORY_NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
					<key>extension_attributes</key>
					<array>
						<dict>
							<key>name</key>
							<string>AdobeAIRVersion</string>
							<key>ext_attribute_path</key>
							<string>%RECIPE_DIR%/AdobeAIRExtensionAttribute.xml</string>
						</dict>
					</array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
