<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of CoRD and creates a package. Then, uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.autopkgg.jss.CoRD</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>CoRD</string>
			<key>JSS_INVENTORY_NAME</key>
			<string>CoRD.app</string>
            <key>CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
			<!--PlistReader w/o variable injection in AutoPkg requires this-->
			<key>version</key>
			<string/>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/CoRD.png</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
            <key>DESCRIPTION</key>
            <string>Native, open source remote desktop client for Microsoft Remote Desktop and Terminal Services.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.1</string>
        <key>ParentRecipe</key>
        <string>com.github.golbiga.pkg.CoRD</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
					<key>jss_inventory_name</key>
					<string>%JSS_INVENTORY_NAME%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
