<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of R and creates a package. Then, uploads to the JSS.</string>
		<key>Identifier</key>
		<string>com.github.autopkg.jss.R-snowleopard</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>R</string>
			<key>OS_RELEASE</key>
			<string>snowleopard</string>
			<key>JSS_INVENTORY_NAME</key>
			<string>R.app</string>
			<key>CATEGORY</key>
			<string>Scientific</string>
			<key>POLICY_CATEGORY</key>
			<string>Testing</string>
			<!--PlistReader w/o variable injection in AutoPkg requires this-->
			<key>version</key>
			<string/>
			<key>POLICY_TEMPLATE</key>
			<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
			<key>ICON</key>
			<string>%RECIPE_DIR%/R.png</string>
			<key>GROUP_NAME</key>
			<string>%NAME%-snowleopard-update-smart</string>
			<key>GROUP_TEMPLATE</key>
			<string>%RECIPE_DIR%/RSnowleopardSmartGroupTemplate.xml</string>
			<key>DESCRIPTION</key>
			<string>R is a language and environment for statistical computing and graphics.</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>ParentRecipe</key>
		<string>com.github.autopkg.pkg.R</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>prod_name</key>
					<string>%NAME%-snowleopard</string>
					<key>version</key>
					<string>%CURRENT_VERSION%</string>
					<key>jss_inventory_name</key>
					<string>%JSS_INVENTORY_NAME%</string>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>policy_category</key>
					<string>%POLICY_CATEGORY%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>self_service_icon</key>
					<string>%ICON%</string>
					<key>self_service_description</key>
					<string>%DESCRIPTION%</string>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>%GROUP_NAME%</string>
							<key>smart</key>
							<true/>
							<key>template_path</key>
							<string>%GROUP_TEMPLATE%</string>
						</dict>
					</array>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
		</array>
	</dict>
</plist>
