<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads updates for TextMate 2 and imports them into your JSS.</string>
		<key>Identifier</key>
		<string>com.github.autopkg.jss.TextMate2</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>TextMate2</string>
			<key>JSS_INVENTORY_NAME</key>
			<string>TextMate.app</string>
			<key>CATEGORY</key>
			<string>Text Editing</string>
			<key>POLICY_CATEGORY</key>
			<string>Testing</string>
			<key>POLICY_TEMPLATE</key>
			<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
			<key>ICON</key>
			<string>%RECIPE_DIR%/TextMate.png</string>
			<key>GROUP_NAME</key>
			<string>TextMate2-update-smart</string>
			<key>GROUP_TEMPLATE</key>
			<string>%RECIPE_DIR%/TextMate2SmartGroupTemplate.xml</string>
			<key>SCRIPT_TEMPLATE</key>
			<string>%RECIPE_DIR%/TextMate2ScriptTemplate.xml</string>
			<key>DESCRIPTION</key>
			<string>TextMate brings Apple's approach to operating systems into the world of text editors.</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>ParentRecipe</key>
		<string>com.github.golbiga.pkg.TextMate2</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>jss_inventory_name</key>
					<string>%JSS_INVENTORY_NAME%</string>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>policy_category</key>
					<string>%POLICY_CATEGORY%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>self_service_icon</key>
					<string>%ICON%</string>
					<key>self_service_description</key>
					<string>%DESCRIPTION%</string>
					<key>scripts</key>
					<array>
						<dict>
							<key>name</key>
							<string>%RECIPE_DIR%/TextMate2Preinstall.sh</string>
							<key>template_path</key>
							<string>%SCRIPT_TEMPLATE%</string>
						</dict>
					</array>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>%GROUP_NAME%</string>
							<key>smart</key>
							<true/>
							<key>template_path</key>
							<string>%GROUP_TEMPLATE%</string>
						</dict>
					</array>
					<key>extension_attributes</key>
					<array>
						<dict>
							<key>name</key>
							<string>TextMateVersion</string>
							<key>ext_attribute_path</key>
							<string>%RECIPE_DIR%/TextMate2ExtensionAttribute.xml</string>
						</dict>
					</array>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
		</array>
	</dict>
</plist>
