<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of MacVector 13 and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.golbiga.munki.MacVector13</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MacVector</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/MacVector Inc/MacVector</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Scientific</string>
			<key>description</key>
			<string>MacVector is a comprehensive Macintosh application that provides sequence editing, primer design, internet database searching, protein analysis, sequence confirmation, multiple sequence alignment, phylogenetic reconstruction, coding region analysis, and a variety of other functions.</string>
			<key>developer</key>
			<string>MacVector Inc</string>
			<key>display_name</key>
			<string>MacVector 13</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>installs</key>
				<array>
					<dict>
						<key>CFBundleIdentifier</key>
						<string>com.macvector.MacVector</string>
						<key>CFBundleName</key>
						<string>MacVector</string>
						<key>CFBundleShortVersionString</key>
						<string>13.0.3</string>
						<key>minosversion</key>
						<string>10.6</string>
						<key>path</key>
						<string>/Applications/MacVector/MacVector.app</string>
						<key>type</key>
						<string>application</string>
						<key>version_comparison_key</key>
						<string>CFBundleShortVersionString</string>
					</dict>
				</array>
			<key>items_to_copy</key>
			<array>
				<dict>
					<key>destination_path</key>
					<string>/Applications/MacVector</string>
					<key>source_item</key>
					<string>MacVector.app</string>
				</dict>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>ParentRecipe</key>
	<string>com.github.golbiga.download.MacVector13</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>