<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.R</string>
	<key>Description</key>
	<string>Downloads updates for R and copies pkg.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.pkg.R</string>
	<key>Input</key>
	<dict>
		<key>Name</key>
		<string>R</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/*.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%CURRENT_VERSION%-%OS_RELEASE%.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>